const QUIZ_03 = {
	NAR1: '학교가 끝나고 [아동 이름]이가 학교 놀이터에서\n공을 가지고 놀고 있다고 상상해 보세요. 하지만\n[아동 이름]이가 공을 가지고 놀 수 있는\n공간이 아주 작아요.',
	NAR2: '[아동 이름]이와 같은 학교에 다니는 아이와 다른\n학교에 다니는 아이가 둘 다 [아동 이름]이랑 함께\n놀고 싶어 해요.',
	NAR3: '두 아이 모두 [아동 이름]이와 놀 수 있지만,\n공간이 아주 작기 때문에 [아동 이름]이랑 같은 학교에\n다니는 아이만 골라서 함께 놀기로 해요.',

	QOX1: `"다른 학교에서 온 아이가 혼자\n남겨졌다고 느낄 수 있기 때문에\n나는 안됐다고 느낄 것 같아요."`,
	QOX2: `"그래도 나에게는 여전히\n같이 놀 사람이 있기 때문에 나는\n별로 신경 쓰지 않을 것 같아요."`,
	QOX3: `"다른 아이를 놀이에 껴주지 않은 것\n때문에 내가 혼날 수도 있어서,\n나는 마음이 불편할 것 같아요."`,

	NEXT1: '오~ 훌륭한걸?\n다음으로 넘어가보자!',
	NEXT2: '멋있어!\n다음으로 넘어가 볼까?',
	NEXT3: '멋있어!\n다음 이야기로 넘어가 볼까?',
} as const;

export default QUIZ_03;
