const QUIZ_01 = {
	NAR1: '[아동 이름]이가 [아동 이름]이 반에 있는데',
	NAR2: '같은 반 아이 한 명이 장난감을 잃어버려서\n모두에게 장난감 찾는 것을 도와달라고\n부탁한다고 상상해 보세요.',
	NAR3: '하지만 반 아이들 중 아무도 장난감\n찾는 것을 도와주지 않아요.',
	NAR4: '아무도 도와주지 않아서 장난감을\n잃어버린 친구는 책상에 앉아서\n슬픈 표정을 하고 있어요.',

	QOX1: `"그 아이가 외롭다고 느낄 것 같아서\n나는 마음이 안 좋을 것 같아요."`,
	QOX2: `"그건 그 아이의 문제니까 나는 딱히\n신경쓰지 않을 것 같아요. 장난감을\n잃어버린 것은 친구니 내가 아니니까요."`,
	QOX3: `"나는 마음이 안 좋을 것 같아요.\n왜냐하면 내가 만약에라도 도움이 필요할 때,\n그 아이가 나를 안 도와줄 수도 있으니까요."`,

	NEXT1: '잘했어!\n다음으로 넘어가 볼까?',
	NEXT2: '좋았어!\n다음 문제로 넘어가 보자~',
	NEXT3: '잘했어!\n다음 이야기로 넘어가 볼까?',
} as const;

export default QUIZ_01;
