const QUIZ_05 = {
	NAR1: '[아동 이름]이가 학교에서 그림 그리기를\n하고 있다고 상상해 보세요.',
	NAR2: '선생님께서 [아동 이름]이에게 빨간색 물감을\n사용하라고 하셨지만 [아동 이름]이는 빨간색 대신\n파란색 물감을 사용해요.',
	NAR3: '[아동 이름]이가 색칠을 다 했는데 선생님께서는\n[아동 이름]이가 잘못된 색을 사용했기 때문에\n처음부터 다시하라고 말씀하셨어요.',

	QOX1: `"나는 괜찮을 것 같아요. 왜냐하면\n다음 번에는 선생님 말씀을 더 주의 깊게\n들으면 된다는 것을 배울 수 있었으니까요."`,
	QOX2: `"나는 괜찮을 것 같아요. 왜냐하면\n분명히 나말고도 잘못된 색으로\n칠한 아이들이 또 있을 거니까요."`,
	QOX3: `"나는 잘못된 색으로 그림을 그린\n나 스스로에게 화가 날 것 같아요."`,

	NEXT1: '오~ 훌륭한걸?\n다음으로 넘어가 보자!',
	NEXT2: '잘했어!\n다음으로 넘어가 볼까?',
	NEXT3: '오~ 대단해!\n다음 이야기로 넘어가 볼까?',
} as const;

export default QUIZ_05;
