const QUIZ_08 = {
	NAR1: '선생님께서 막대사탕을 나눠주고 계시고,\n많은 학생들이 줄을 서서 기다리고\n있다고 상상해 보세요.',
	NAR2: '[아동 이름]이는 줄 맨 뒤에 서있어요. [아동이\n름]이의 차례가 다가오면서, 막대사탕이 한 개\n밖에 남지 않았다는 것을 알게 되었어요.',
	NAR3: '[아동 이름]이는 앞에 있는 아이를 줄 밖으로 밀\n쳐내고 마지막 막대사탕을 받게 되었어요.',

	QOX1: `"그 아이가 원래 나보다 먼저였기\n때문에 나는 마음이 불편할 것 같아요.`,
	QOX1_1: `그건 공평하지 않은 방법이고\n그 아이가 다칠 수도 있기 때문이에요."`,
	QOX2: `"선생님이 바로 앞에 서 계시고\n나한테 화를 내실 수도 있기 때문에\n기분이 안 좋을 것 같아요."`,
	QOX3: `"마지막 막대사탕을 내가 가져가서\n나는 행복할 것 같아요."`,

	NEXT1: '아주 훌륭해!\n다음으로 넘어가 볼까?',
	NEXT2: '좋았어!\n다음으로 넘어가 볼까?',
	NEXT3: '장말 훌륭해!\n마지막 이야기로 넘어가 볼까?',
} as const;

export default QUIZ_08;
