const QUIZ_09 = {
	NAR1: '[아동 이름]이가 좋아하는 장난감을 다음날 학교\n에 있는 모두에게 보여주기 위해 가방에 넣어야\n한다고 상상해 보세요.',
	NAR2: '다음 날, [아동 이름]이는 장난감을 가방에 넣는\n것을 잊어버렸고, 이제 학교에서 아무것도\n보여줄 것이 없다는 것을 깨달았어요.',

	QOX1: `"나는 괜찮을 것 같아요. 왜냐하면 모든\n사람들은 가끔씩 무엇인가를\n잊어버리기도 하기 때문이에요."`,
	QOX2: `"내가 바빠서 그랬던게 틀림없고\n다음부터는 더 조심하면 되니까,\n나는 괜찮을 것 같아요."`,
	QOX3: `"내가 그것을 기억했어야 했는데,\n이제 나는 가장 좋아하는 장난감을\n모두에게 보여줄 수 없게 되었어요.`,
	QOX3_1: `그래서 나 스스로에게\n화가 날 것 같아요."`,

	NEXT1: '좋았어!\n다음 문제로 넘어가 보자!',
	NEXT2: '잘했어!\n다음으로 넘어가 볼까?',
} as const;

export default QUIZ_09;
