const QUIZ_06 = {
	NAR1: '[아동 이름]이가 학교에서 친구들과 함께\n앉아있다고 상상해보세요.',
	NAR2: '[아동 이름]이의 나라로 최근에 이사오게 된 이민자\n아이가 [아동 이름]이의 옆 자리에 앉고 싶어해요.',
	NAR3: '다른 나라에서 온 사람을 이민자라고 불러요.',
	NAR4: '이민자 아이가 [아동 이름]이와 함께 앉아도\n되냐고 묻자, [아동 이름]이는 "안돼"라고 답해요.',

	QOX1: `"그 아이가 혼자 남겨졌다고 느낄까봐"\n내 마음이 좋지 않을 것 같아요."`,
	QOX2: `"선생님께서 알게 되시면 내가"\n혼날 수도 있기 때문에 난 기분이\n좋지 않을 것 같아요."`,
	QOX3: `"이제부터 나는 그냥 내 친구들과\n이야기할 수 있으니까\n기분이 좋을 것 같아요."`,

	NEXT1: '좋았어!\n다음 문제로 넘어가 보자!',
	NEXT2: '아주 훌륭해!\n다음 문제로 넘어가 보자!',
	NEXT3: '좋았어!\n다음 이야기로 넘어가 볼까?',
} as const;

export default QUIZ_06;
