const QUIZ_04 = {
	NAR1: '[아동 이름]이가 학교(어린이집, 유치원)에 있는데\n밖에 날씨가 덥다고 상상해 보세요.',
	NAR2: `선생님이 [아동 이름]이에게 두 개의 작은 아이스크림을\n주면서 '하나는 [아동 이름]이거고 다른 하나는 친구거야'\n라고 말하셨어요.`,
	NAR3: '[아동 이름]이는 아이스크림을 정말 좋아하기 때문에\n재빨리 아이스크림 하나를 먹었어요.',
	NAR4: '그리고 친구한테 나머지 하나가 친구 것이라고\n말하지 않고 [아동 이름]이는 남은 한 개도\n[아동 이름]이가 먹어버렸어요.',

	QOX1: `"그 친구도 아이스크림을 원했을텐데\n더 이상 아이스크림을 먹을 수 없게 되었어요.\n그래서 나는 마음이 좋지 않을 것 같아요."`,
	QOX2: `"내가 아이스크림 두개를 모두 먹었다는\n사실을 선생님께서 알게 되실까봐\n나는 마음이 불편할 것 같아요."`,
	QOX3: `"내가 아이스크림 두 개를 다 먹어서\n나는 행복할 것 같아요."`,

	NEXT1: '잘했어!\n우리 또 해볼까?',
	NEXT2: '좋았어!\n다음 문제로 넘어가 보자!',
	NEXT3: '정말 잘했어!\n다음 이야기로 넘어가 볼까?',
} as const;

export default QUIZ_04;
