type NextMessage = {
  [key: number]: string;
};

const nextMessage: NextMessage[] = [
  {
    // 0-1, 0-2
    0: `잘했어!\n 다음으로 넘어가 볼까?`,
    1: `좋았어!\n 다음 문제로 넘어가 보자~`,
  },

  {
    // 1-1, 1-2
    0: `잘했어!\n 다음으로 넘어가 볼까?`,
    1: `좋았어!\n 다음 문제로 넘어가 보자~`,
  },

  {
    // 2-1, 2-2
    0: `아주 훌륭해!\n 다음 문제로 넘어가 볼까?`,
    1: `정말 잘했어!\n 다음으로 넘어가 보자!`,
  },

  {
    // 3-1, 3-2
    0: `오~ 훌륭한 걸?\n 다음으로 넘어가보자!`,
    1: `멋있어!\n 다음으로 넘어가 볼까?`,
  },

  {
    // 4-1, 4-2
    0: `잘했어!\n 우리 또 해볼까?`,
    1: `좋았어!\n 다음 문제로 넘어가 보자!`,
  },

  {
    // 5-1 5-2
    0: `오~ 훌륭한 걸?\n 다음으로 넘어가보자!`,
    1: `잘했어!\n 다음으로 넘어가 볼까?`,
  },

  {
    // 6-1 6-2
    0: `좋았어!\n 다음 문제로 넘어가 보자!`,
    1: `아주 훌륭해!\n 다음 문제로 넘어가 보자!`,
  },

  {
    // 7-1 7-2
    0: `잘했어!\n 우리 다음으로 넘어가 볼까?`,
    1: `멋있어!\n 다음 문제로 넘어가 보자!`,
  },

  {
    // 8-1 8-2
    0: `아주 훌륭해!\n 다음으로 넘어가 볼까?`,
    1: `좋았어!\n 다음으로 넘어가 볼까?`,
  },

  {
    // 9-1 9-2
    0: `좋았어!\n 다음 문제로 넘어가 보자!`,
    1: `잘했어!\n 다음으로 넘어가 볼까?`,
  },
];

const getNextMessage = (exId: number, oxId: number): string => {
  return nextMessage[exId][oxId];
};

export default getNextMessage;
