interface NarrationProps {
  name: string;
  exId: number;
}

type NarrationData = {
  [key: string]: string[];
};

type ExperimentData = {
  narration: NarrationData;
};

const getNarration = ({ name, exId }: NarrationProps): ExperimentData => {
  const narrationData = [
    {
      "0": [
        `${name}가 ${name} 반에 있는데`,
        "같은 반 아이 한 명이 장난감을 잃어버려서 \n모두에게 장난감 찾는 것을 도와달라고 \n부탁한다고 상상해 보세요.",
        "하지만 반 아이들 중 아무도 장난감 \n찾는 것을 도와주지 않아요.",
      ],
      "1": ["아무도 도와주지 않아서 장난감을 \n잃어버린 친구는 책상에 앉아서 \n슬픈 표정을 하고 있어요."],
    },

    {
      0: [`${name}가 친구에게 놀자고 했는데`],
      1: ["친구가 싫다고 했다고 상상해 보세요."],
    },

    {
      0: [
        `학교가 끝나고 ${name}이가 학교 놀이터에서 \n공을 가지고 놀고 있다고 상상해 보세요. 하지만 \n${name}가 공을 가지고 놀 수 있는 \n공간이 아주 작아요.`,
        `${name}와 같은 학교에 다니는 아이와 다른 \n학교에 다니는 아이가 둘 다 ${name}랑 함께\n놀고 싶어 해요.`,
      ],
      1: [
        `두 아이 모두 ${name}와 놀 수 있지만, \n공간이 아주 작기 때문에 ${name}랑 같은 학교에 \n다니는 아이만 골라서 함께 놀기로 해요.`,
      ],
    },

    {
      0: [
        `${name}가 학교(어린이집, 유치원)에 있는데 \n밖에 날씨가 덥다고 상상해 보세요.`,
        `선생님이 ${name}에게 두 개의 작은 아이스크림을 \n주면서 '하나는 ${name}거고 다른 하나는 친구거야' \n라고 말하셨어요.`,
      ],
      1: [
        `${name}이는 아이스크림을 정말 좋아하기 때문에 \n재빨리 아이스크림 하나를 먹었어요.`,
        `그리고 친구한테 나머지 하나가 친구 것이라고 \n말하지 않고 ${name}는 남은 한 개도 \n${name}가 먹어버렸어요.`,
      ],
    },

    {
      0: [
        `${name}가 학교에서 그림 그리기를 \n하고 있다고 상상해 보세요.`,
        `선생님께서 ${name}에게 빨간색 물감을 \n사용하라고 하셨지만 ${name}는 빨간색 대신 \n파란색 물감을 사용해요.`,
      ],
      1: [
        `${name}가 색칠을 다 했는데 선생님께서는 \n${name}가 잘못된 색을 사용했기 때문에 \n처음부터 다시하라고 말씀하셨어요.`,
      ],
    },

    {
      0: [
        `${name}가 학교에서 친구들과 함께 \n앉아있다고 상상해보세요.`,
        `${name}와 나라로 최근에 이사오게 된 이민자 \n아이가 ${name}의 옆 자리에 앉고 싶어해요.`,
        "다른 나라에서 온 사람을 이민자라고 불러요.",
      ],
      1: [`이민자 아이가 ${name}와 함께 앉아도 \n되냐고 묻자, ${name}는 "안돼"라고 답해요.`],
    },

    {
      0: [`${name}가 학교에 있는데 아이들 몇명이 \n어떤 한 아이의 별명을 부르면서 \n놀리고 있다고 상상해 보세요.`],
      1: ["그 아이는 슬퍼 보여요."],
    },

    {
      0: [
        "선생님께서 막대사탕을 나눠주고 계시고, \n많은 학생들이 줄을 서서 기다리고 \n있다고 상상해 보세요.",
        `${name}는 줄 맨 뒤에 서있어요. \n${name}의 차례가 다가오면서, 막대사탕이 한 개 \n밖에 남지 않았다는 것을 알게 되었어요.`,
      ],
      1: [`${name}는 앞에 있는 아이를 줄 밖으로 밀 \n쳐내고 마지막 막대사탕을 받게 되었어요.`],
    },

    {
      0: [
        `${name}가 좋아하는 장난감을 다음날 학교 \n에 있는 모두에게 보여주기 위해 가방에 넣어야\n한다고 상상해 보세요.`,
      ],
      1: [
        `다음 날, ${name}는 장난감을 가방에 넣는 \n것을 잊어버렸고, 이제 학교에서 아무것도 \n보여줄 것이 없다는 것을 깨달았어요.`,
      ],
    },
  ];

  return { narration: narrationData[exId] };
};

export default getNarration;
